app/controllers/books_controller.rb

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM `authors`
---
  def new
    @book = Book.new
    @authors = Author.find :all

INSERT INTO `books` (`name`, `created_at`, `isbn`, `updated_at`, `author_id`) VALUES('asdfsdf', '2009-12-29 12:49:12', 120987098, '2009-12-29 12:49:12', '1')
SELECT * FROM `authors`
---
  def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save
        flash[:notice] = 'Book was successfully created.'
        format.html { redirect_to(@book) }
        format.xml  { render :xml => @book, :status => :created, :location => @book }
      else
        @authors = Author.find :all

SELECT * FROM `books` WHERE (`books`.`id` = 2)
DELETE FROM `books` WHERE `id` = 2
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy